{"speaker_list": [{"job": "OSS Redis coding - Redis Labs", "level": "Intermediate", "speaker": "Salvatore Sanfilippo", "title": "Running Redis for 8 years: what I learned about people and technology.", "description": "\n\t\t\tConsiderations about human and technological factors, learned on the field while creating, supporting and handling the community of the Redis database project.\t\t", "language": "English"}, {"job": "Principal Software Engineer - Netflix", "level": "Intermediate", "speaker": "Yunong Xiao", "title": "The Paved PaaS to Microservices", "description": "\n\t\t\tTraditionally, a tug of war has existed between service reliability (availability, consistency, and fault tolerance), and engineering velocity. Increasing speed to fuel product innovation has meant making reliability tradeoffs. In this talk Yunong will describe how abstracting away the infrastructure and common platform components by using a Platform as a Service (Paas) model can enable service owners to increase both velocity and reliability.\t\t", "language": "English"}, {"job": "Engineer - Docker", "level": "Intermediate", "speaker": "Justin Cormack", "title": "The 10 Container Security Tricks That Will Help You Sleep At Night", "description": "\n\t\t\tContainers, and the tooling around them, make some parts of application security that much easier. There are some simple things you can do to make a substantial difference to the security of your applications without making any big changes to what you do. This talk will give you some small changes you can make in a few hours that will make it that much more difficult to hack your applications.\t\t", "language": "English"}, {"job": "AI DevRel | EMEA - NVIDIA", "level": "Intermediate", "speaker": "Alison B Lowndes", "title": "Fueling the Artificial Intelligence Revolution with Gaming", "description": "\n\t\t\tBuilding upon the foundational understanding of deep learning, this talk will cover a wide variety of applications of artificial intelligence for problem-solving and how you can both get started and become proficient with NVIDIA’s hardware, open-source software & classes. We will also discuss the role of games engines both historically and current day in teaching today's AI systems.\t\t", "language": "English"}, {"job": "Software Engineer - Stack Overflow", "level": "Beginner", "speaker": "Oded Coster", "title": "Stack Overflow behind the scenes - how it's made", "description": "\n\t\t\tStack Overflow serves over 100 million unique visitors a month, serving a page in 20ms using 9 web servers and 2 database servers.\r\n\r\nIn this talk I will cover how we develop, build, configure, deploy, monitor and maintain the site, as well as cover aspects of working in a team distributed around the world.\t\t", "language": "English"}, {"job": "Solutions Engineer - GitHub", "level": "Non", "speaker": "Brent Beer", "title": "Collaborative Development: The Only CD That Matters", "description": "\n\t\t\tIn today's increasing business need for more deploys, continuous testing, and better quality code, one thing that is not explicitly discussed is a strategy for how software teams should collaborate across their company. Before you invest all your time and energy into Continuous Integration or Continuous Delivery, make sure you have a solid foundation of Collaborative Development. In this talk, we'll look at some collaboration patterns that have had success, why they're important, and how you can adopt these patterns within your own software development teams to build software better tomorrow.\t\t", "language": "English"}, {"job": "CEO/Co-founder - Radically Open Security", "level": "Intermediate", "speaker": "Melanie Rieback", "title": "Pentesting ChatOps", "description": "\n\t\t\tChatOps, a concept originating from Github, is chatroom-driven DevOps for distributed teams, using chatbots (like Hubot) to execute custom scripts and plugins. We have applied the concept of ChatOps to the penetration testing workflow, and found that it fits outstandingly – for everything from routine scanning to spearphishing to pentest gamification. This talk discusses the tools that we use (RocketChat, Hubot, Gitlab, pentesting tools), and provides battle stories of using Pentesting ChatOps in practice.\t\t", "language": "English"}, {"job": "Visual Designer & Front-end Developer - Adobe", "level": "Intermediate", "speaker": "Agnieszka Naplocha", "title": "Breaking the norm with creative CSS", "description": "\n\t\t\tFeeling uninspired and tired of constantly building the same layouts? Let’s leverage the CSS superpowers you might have heard about before, but haven’t already used. Let’s explore new CSS features that give us a great set of tools and enable to do amazing things on the web! The future of web graphics and CSS as a design language is bright, and finally it will make us less dependent on the image editors. We’re entering the new era with in-browser designing. Don’t stay behind and get some fresh air of creativity directly in the web browser.\t\t", "language": "English"}, {"job": "Senior Software Engineer - Zalando", "level": "Intermediate", "speaker": "Dan Persa", "title": "The Recipe For Scalable Frontends", "description": "\n\t\t\tThe future of e-commerce requires personalized content for each individual customer. With over 20 million active users, Zalando is facing the challenge of making its frontends more scalable in order to achieve this goal. We brought a solution from the backend to the frontend: microservices. In addition to creating Project Mosaic (https://www.mosaic9.org)—our solution for modular frontends—and using a toolbox of modern web technologies like React and Webpack, we built an architecture that can scale to virtually any size and even support targets other than the browser.\t\t", "language": "English"}, {"job": "Senior Researcher - Trend Micro", "level": "Intermediate", "speaker": "Marco Balduzzi", "title": "Cyber-crime and attacks in the dark side of the web", "description": "\n\t\t\tThe dark-web including TOR, FreeNet and I2P, is that part of the Internet that is not indexed by traditional search engines and where anonymity and confidentiality is enforced at the root. For these characteristics, cyber- criminals started abusing the dark-web to conduct illicit or malicious activities like illegal trading, malware hosting, and more recently targeted attacks. In this talk, we explore the cyber-criminal ecosystem in the dark-web and provides insights on its activities against hidden services and other users.\t\t", "language": "English"}, {"job": "Data scientist - The Alan Turing Institute", "level": "Intermediate", "speaker": "Evelina Gabasova", "title": "The mysterious correlation: a detective story", "description": "\n\t\t\tIn data science, sometimes you stumble across an intriguing property in the data. I will tell you a story of a mysterious correlation - from StackOverflow survey it seems that developers who use spaces have higher salaries than those who use tabs. Correlation doesn’t mean causation: using spaces won’t suddenly increase your salary. But what does it all mean? Follow me into a detective investigation that will show you how to approach complex data science problems. I will show you some of the perils of correlation, model fitting and biases - how they can be dangerous and how to deal with them.\t\t", "language": "English"}, {"job": "Software Engineer - Yelp", "level": "Intermediate", "speaker": "Tomer Elmalem", "title": "GraphQL APIs: REST in Peace", "description": "\n\t\t\tThis talk will introduce attendees to GraphQL and then dive into the intricacies of how we built the API. It’ll cover end-to-end the flow we provide to our developers and some of the specific considerations we took when making it a public API:\r\n* solving the N+1 data retrieval problem and query planning\r\n* structuring models for optimal data retrieval\r\n* when to use GraphQL\r\n \r\nThis talk will also cover some of the specifics of hooking GraphQL into a service-oriented architecture, how it’s built into our infrastructure, and the advantages you gain by having GraphQL interface with your services.\t\t", "language": "English"}, {"job": "Developer Advocate - IBM", "level": "Non", "speaker": "Lorna Mitchell", "title": "Becoming Polyglot", "description": "\n\t\t\tTo be polyglot is to be a true citizen of the software world; to accrue and apply skills beyond the technologies you use in your day-to-day activities.  Some of our best work as engineers transcends a particular language or tool: debugging superpowers are needed in every tech stack, and the ability to coax a new toolchain to play nicely is a key skill.  Tips for approaching new tools, platforms and communities will help you confidently pick up some fresh technologies and add new tools to your toolbox.\t\t", "language": "English"}, {"job": "Curriculum Lead, Android - Udacity", "level": "Intermediate", "speaker": "James Williams", "title": "Demystifying Constraint Layout", "description": "\n\t\t\tSince its release, ConstraintLayout has had the reputation of being very powerful but difficult to learn. Too many times have I talked to developers who were reluctant to use it in their designs because it was \"too magical\" and they couldn't understand what it was doing. Despite the learning curve, ConstraintLayout allows you to make your designs more responsive and ultimately make your UI code faster to render. It also includes some design features that allow you to more accurately implement your designer's work. \r\n\r\nIn this session, you'll learn how to make sense of the features of ConstraintL\t\t", "language": "English"}, {"job": "Software Engineer - Red Hat", "level": "Advanced", "speaker": "Mario Fusco", "title": "Reactive programming in Java", "description": "\n\t\t\tReactive programming è un paradigma di programmazione basato sulla processazione asincrona di eventi. La sua cresente importanza è confermata dall'introduzione in Java 9 delle Flow API che definiscono un contratto che tutte le librerie di reacrive programming dovranno implementare. Lo scopo di questo talk è chiarire i principi del reactive programming definite dal reactive manifesto e formalizzate dalle Flow API insieme alle feature più avanzate di processazione, trasformazione e combinazione di eventi offerti da RxJava.\t\t", "language": "Italian"}, {"job": "Senior Product Manager & Engineer - SoundCloud", "level": "Intermediate", "speaker": "Tiffany Conroy", "title": "Remote device sign-in – Authenticating without a keyboard", "description": "\n\t\t\tWhen we were developing our SoundCloud app for Xbox One, something became very obvious during usability testing: signing in with a game controller really sucks. Entering text requires navigating a virtual keyboard to individual letters, numbers, and characters one at a time – such a nightmare! Other connected devices are even more extreme, with no way to enter text at all. Learn how to implement what we call “remote device sign-in”, a way for people to sign in to devices with limited input capability that is secure, simple, and fast.\t\t", "language": "English"}, {"job": "Senior Design Manager, Design Ops, Systems and Tooling - Skyscanner", "level": "Non", "speaker": "James Ferguson", "title": "A design system. A year in review.", "description": "\n\t\t\tDesign and Engineering at scale is hard. I’ll uncover our journey in creating a Design System for Skyscanner in a bid to bridge the gap between design and engineering. I’ll share our learnings on how we sold it to the business by proving its worth. You’ll learn about some of the design and tech considerations we’ve made and the tools and techniques which have helped us along the way.\r\n\r\nOne year in, we’re now starting to see the fruits of our labour as an organisation of over 900 employees are using our design system on a daily basis to ultimately get to market quicker.\t\t", "language": "English"}, {"job": "Distributed Systems Engineer - Mesosphere", "level": "Intermediate", "speaker": "Jörg Schad", "title": "NO ONE PUTS Java IN THE CONTAINER", "description": "\n\t\t\tThe current craze of Docker has everyone sticking their processes inside a container… but do you really understand cgroups and how they work? Do you understand the difference between CPU Sets and CPU Shares? Spark is a Scala application that lives inside a Java Runtime, do you understand the consequence of what impact the cgroup constraints have on the JRE? This talk starts with a deep understand of Java’s memory management and GC characteristics and how JRE characteristics change based on core count. We will continue the talk looking at containers and how resource isolation works.\t\t", "language": "English"}, {"job": "Tech lead - Tuenti", "level": "Non", "speaker": "Josefina Pérez", "title": "War of the Worlds: devs vs designers", "description": "\n\t\t\tIt is clear that designers are from Mars and developers from Venus. They come from different worlds but, even with that, they have to work together to create and release a product. Laura Andina (UX) and Josefina Perez (Software Engineer), will tell us, from their experience, how to make that devs and designers work together... without dying while trying!\t\t", "language": "English"}, {"job": "UX & Research Lead - Tuenti", "level": "Non", "speaker": "Laura Andina", "title": "War of the Worlds: devs vs designers", "description": "\n\t\t\tIt is clear that designers are from Mars and developers from Venus. They come from different worlds but, even with that, they have to work together to create and release a product. Laura Andina (UX) and Josefina Perez (Software Engineer), will tell us, from their experience, how to make that devs and designers work together... without dying while trying!\t\t", "language": "English"}, {"job": "Software developer - Lambda Factory", "level": "Intermediate", "speaker": "Krzysztof Cieslak", "title": "Hacking F# in JS ecosystem", "description": "\n\t\t\tJavascript has conquered the world – developers can use it in the browser, on the server, to write mobile apps, on the desktop with Electron, and even to create serverless services. Like the language or not, the truth is JS developers have built an incredible ecosystem with libraries and tools to do almost anything. During the talk I’ll show how to bring the power of F# - the functional paradigm, static typing with type inference, pattern matching, and more modern language features – to this huge and rich JS world using Fable – F# to JS compiler.\t\t", "language": "English"}, {"job": "Front-End Engineer - Brainly", "level": "Beginner", "speaker": "Konrad Dzwinel", "title": "Alternative Reality DevTools", "description": "\n\t\t\tEleven years after the first release of Firebug, all browsers now have excellent developer tools of their own. One thing that always bothered me though, is how very similar these tools became to one another! I started looking for an inspiration on how the alternative versions of devtools could look like. I asked game devs, designers, architects, scientists and electrical engineers to introduce me to their tooling. This research gave a unique perspective on devtools and allowed me to build some interesting prototypes. In this talk I’d like to share both, the conclusions and the demos, with you.\t\t", "language": "English"}, {"job": "Co-Founder - Connta", "level": "Beginner", "speaker": "Natalie Pistunovich", "title": "Developing for the Next Billion Users", "description": "\n\t\t\tThe next billion people going online live in emerging countries, where the mobile phone is the main point of communication, the use of mobile apps and web is different and the infrastructure places limits on internet usage. Getting a better understanding will improve the inclusiveness of your work towards people worldwide.\r\n\r\nIn this talk the speaker will share her experience, from both researching and putting the learnings to practice in Nairobi.\r\n\r\nSome of the subjects we'll cover include: the local tech ecosystem, common apps and devices, localisation guidelines and technical limitations.\t\t", "language": "English"}, {"job": "Director - Compositional IT", "level": "Intermediate", "speaker": "Isaac Abraham", "title": "Taming Types in the Cloud", "description": "\n\t\t\tThis talk will focus on how we can make use of F#’s type system in tandem with distant data sources in order to provide a stable foundation for developing on top of standard Azure services through the use of type providers. Through both slides and live coding demos, the presentation will illustrate how type providers can simplify many day-to-day tasks when working with Azure Storage, as well as how remote data can be used to intelligently guide type systems to provide extra safety to the developer than otherwise might be expected.\t\t", "language": "English"}, {"job": "IT Consultant - Starbucks", "level": "Intermediate", "speaker": "Rafal Gancarz", "title": "Serverless for the Enterprise", "description": "\n\t\t\tServerless computing is steadily gaining momentum in the IT industry and more companies are looking to leverage this new way of building and running cloud native systems. Yet, since this area is still relatively young, many are confused about best ways to go about building serverless architectures, particularly more complex ones.\r\n\r\nIn this talk, I'll discuss how common Enterprise specific requirements and challenges can be addressed while building large systems using FaaS/Serverless stack on AWS.\t\t", "language": "English"}, {"job": "Senior Software Developer - Planet9 Energy", "level": "Intermediate", "speaker": "Luciano Mammino", "title": "Cracking JWT tokens: a tale of magic, Node.JS and parallel computing", "description": "\n\t\t\tLearn how you can use some JavaScript/Node.js black magic to crack JWT tokens and impersonate other users or escalate privileges. Just add a pinch of ZeroMQ, a dose of parallel computing, a 4 leaf clover, mix everything applying some brute force and you'll get a powerful JWT cracking potion!\t\t", "language": "English"}, {"job": "Software Developer Engineer in Test II - Hotels.com", "level": "Intermediate", "speaker": "Annarita De Biase", "title": "API Release Process: how to make people happy", "description": "\n\t\t\tWe would like to suggest a sustainable delivery process that defeated the chaos caused by their usage complexity and now stakeholders, business, developers, quality assurance and users are happier.\r\n\r\nVelocity + High Quality = $$$\r\n\r\nHow can you use this approach to improve your business? What are the reasons why our nerdy world is so resistant to speed up time to market?\r\n\r\nCome with us in a nice journey through our experience in Hotels.com.\r\n\r\nVirtualization, parallelism, containers and other nice stuff for a final demo.\t\t", "language": "Italian"}, {"job": "Owner, Business Consultant, IT do-it-all - Advies en zo", "level": "Intermediate", "speaker": "Juliette Reinders Folmer", "title": "Promote your open source project with GitHub Pages", "description": "\n\t\t\tNeed a website for an open source project of which the code is on GitHub ?\r\n\r\nGitHub Pages might be a viable option. GitHub Pages allows you to build a site based on simple markdown text files and with a sprinkling of magic stardust you can pull in the changelog of your project from GitHub, show off a list of the contributors to the project and more.\r\n\r\nJoin me to learn what GH Pages are and how to get your project web presence with little effort.\t\t", "language": "English"}, {"job": "Qa Manager - Hotels.com", "level": "Intermediate", "speaker": "Camillo Quatrini", "title": "API Release Process: how to make people happy", "description": "\n\t\t\tWe would like to suggest a sustainable delivery process that defeated the chaos caused by their usage complexity and now stakeholders, business, developers, quality assurance and users are happier.\r\n\r\nVelocity + High Quality = $$$\r\n\r\nHow can you use this approach to improve your business? What are the reasons why our nerdy world is so resistant to speed up time to market?\r\n\r\nCome with us in a nice journey through our experience in Hotels.com.\r\n\r\nVirtualization, parallelism, containers and other nice stuff for a final demo.\t\t", "language": "Italian"}, {"job": "Software Development Engineer In Test II - Hotels.com", "level": "Intermediate", "speaker": "Miro Barsocchi", "title": "API Release Process: how to make people happy", "description": "\n\t\t\tWe would like to suggest a sustainable delivery process that defeated the chaos caused by their usage complexity and now stakeholders, business, developers, quality assurance and users are happier.\r\n\r\nVelocity + High Quality = $$$\r\n\r\nHow can you use this approach to improve your business? What are the reasons why our nerdy world is so resistant to speed up time to market?\r\n\r\nCome with us in a nice journey through our experience in Hotels.com.\r\n\r\nVirtualization, parallelism, containers and other nice stuff for a final demo.\t\t", "language": "Italian"}, {"job": "Frontend Developer - extrategy", "level": "Intermediate", "speaker": "Francesco Strazzullo", "title": "JavaScript Frameworkless Development", "description": "\n\t\t\tDo you feel the JavaScript fatigue? Are you still trying to learn ‘the next big thing’? Does your code seem legacy just after six months because of that ‘next big thing’? Have you ever thought of building a software, even a complex one, without any kind of dependency on your package.json? During the talk we are going to see how to create your own framework and libraries with just standard ECMAScript features and W3C standard APIs.\t\t", "language": "Italian"}, {"job": "Founder & DevOps Engineer - SIGHUP", "level": "Intermediate", "speaker": "Jacopo Nardiello", "title": "Monitoring Cloud-Native applications with Prometheus", "description": "\n\t\t\tWe are going to talk about Prometheus and how to use to monitor micro-services \"Cloud-Native\" application\r\ns. We are going to dive deep into the Prometheus monitoring model, we will see what are the components be\r\nhind this system and how they integrate with each others to provide an efficient and modern monitoring sy\r\nstem. We will also have a glance on Prometheus native integrations for cloud-native environments such as\r\nKubernetes.\t\t", "language": "English"}, {"job": "Associate Professor - Politecnico di Milano", "level": "Intermediate", "speaker": "Stefano Zanero", "title": "Night of the living vulnerabilities: forever-days of IoT", "description": "\n\t\t\tIn a tribute to Romero's masterpiece, we will examine the resurgence of vulnerabilities we all thought dead. As soon as a security expert looks at the firmware and code of IoT devices, 2017 may as well be 1997: format string bugs, basic stack overflows and hardcoded credentials arise. Zero-days are actually forever-days.\r\nWe will look at a number of real world cases of industrial and consumer IoT devices we tested and broke, and besides analyzing the most common and most outstanding findings, we will wonder why we seem unable to kill these pests once and forever.\t\t", "language": "English"}, {"job": "Security Engineer - Secure Network", "level": "Intermediate", "speaker": "Roberto Clapis", "title": "Night of the living vulnerabilities: forever-days of IoT", "description": "\n\t\t\tIn a tribute to Romero's masterpiece, we will examine the resurgence of vulnerabilities we all thought dead. As soon as a security expert looks at the firmware and code of IoT devices, 2017 may as well be 1997: format string bugs, basic stack overflows and hardcoded credentials arise. Zero-days are actually forever-days.\r\nWe will look at a number of real world cases of industrial and consumer IoT devices we tested and broke, and besides analyzing the most common and most outstanding findings, we will wonder why we seem unable to kill these pests once and forever.\t\t", "language": "English"}, {"job": "Interface Developer - YOOX NET-A-PORTER GROUP", "level": "Beginner", "speaker": "Samuele Resca", "title": "REACTIVE PROGRAMMING, DAMN. IT IS NOT ABOUT REACTJS", "description": "\n\t\t\tA deep dive into reactive programming. The reactive programming paradigm has gained increasing popularity in recent years as a model that aims to simplify the implementation of event-driven applications and the execution of asynchronous code.\t\t", "language": "English"}, {"job": "Technical Pre-Sales Architect - Open-Xchange", "level": "Intermediate", "speaker": "Andrea Tosatto", "title": "Kubernetes Beyond", "description": "\n\t\t\tAs in the Star Trek Beyond movie, which the title of this talk tries to recall, we will present how Kubernetes can be extended beyond containers using Custom Resource Definitions (CRD) to schedule custom tasks and resources or bring Kubernetes automation to the next level. During the presentation we will go deep into the concept of Operator and provide some useful examples of application of this pattern to, i.e., the automated scaling of Services.\t\t", "language": "English"}, {"job": "Senior Developer - Gamesys", "level": "Intermediate", "speaker": "Yan Cui", "title": "Serverless in production, an experience report", "description": "\n\t\t\tAWS Lambda has changed the way we deploy and run software, but this new serverless paradigm has created new challenges to old problems - how do you test a cloud-hosted function locally? How do you monitor them? What about logging and config management? And how do we start migrating from existing architectures? \r\n\r\nIn this talk Yan will discuss solutions to these challenges by drawing from real-world experience running Lambda in production and migrating from an existing monolithic architecture.\t\t", "language": "English"}, {"job": "Developer - Erlang-Solutions", "level": "Intermediate", "speaker": "Gabriele Santomaggio", "title": "How to build distributed applications with Erlang.", "description": "\n\t\t\tErlang/Elixir sono linguaggi funzionali usati per applicazioni concorrenti, ad alta affidabilità e scalabili. La clusterizzazione è sicuramente  uno dei punti di forza. Nel talk partiremo dai concetti base fino creare una applicazione distribuita attraverso le OTP libraries.  Facebook, Whatsapp ed altri grandi aziende utlizzano queste tecnologie, ma vedremo come possono essere utilizzate in realta piu piccole attraverso casi d'uso reali.\t\t", "language": "Italian"}, {"job": "Cloud Solution Architect - Microsoft Western Europe", "level": "Intermediate", "speaker": "Lorenzo Barbieri", "title": "Serverless computing in Azure: Functions, Logic Apps and more!", "description": "\n\t\t\tServerless is the new black, but it didn't come out of the blue for Azure :-)\r\nFunctions, Logic Apps, Cognitive Services, etc... there are a lot of applications of serverless computing that could change the way you architect and design your applications! Infinite scaling and sub-second billing aren't the only guiding factors to go serverless.\r\nIn this session we'll see some examples and we'll understand when and where it's better to go serverless and when a traditional architecture will be a better choice!\t\t", "language": "Italian"}, {"job": "Frontend Lead - BEKK Consulting", "level": "Intermediate", "speaker": "Erik Wendel", "title": "Beyond JavaScript Frameworks: Writing Reliable Web Apps With Elm", "description": "\n\t\t\tIn times where a jungle of JavaScript frameworks wants to solve every conceivable problem in web app development, Elm offers a different approach.\r\n\r\nElm is a functional language that compiles to JavaScript. It has a user-friendly compiler, a sound type system, built-in immutability and lots of other features that come in handy when developing large, hopefully bug-free, single-page apps. While having fun in the process!\r\n\r\nIn this talk you'll see how Elm works and learn how to use it to build a web app. More importantly, you'll learn the pros and cons of using it over a JavaScript-based solution.\t\t", "language": "English"}, {"job": "lead technologist - ThoughtWorks", "level": "Intermediate", "speaker": "Alessandro Confetti", "title": "Learn how to build decentralized and serverless html5 applications with EmbarkJS, Ethereum and IPFS", "description": "\n\t\t\tDo you have an idea for a startup and don't want to pay for scaling it up? Forget about bandwidth problems, servers to install and pay for, with the power of IPFS and the blockchain.\r\nIn this talk, we will explore how to build an HTML5 DAPP (distributed application) with EmbarkJS, and figure out how to rethink servers, storage, messaging, data and payments in a distributed and decentralised way with the help of Ethereum's smart contracts and IPFS distributed storage.\t\t", "language": "English"}, {"job": "Co-Founder & Software Engineer - buildo", "level": "Intermediate", "speaker": "Gabriele Petronella", "title": "Mythical trees and where to find them", "description": "\n\t\t\tAbstract Syntax Trees (or ASTs) are the core of most tools we use in JavaScript, from Babel to ESLint, from prettier to codemods.\r\nIn this talk we see what they are, how they power such tools and how to use them directly to develop custom solutions to everyday problems.\t\t", "language": "English"}, {"job": "Co-Founder & Software Engineer - buildo", "level": "Intermediate", "speaker": "Gabriele Petronella", "title": "Mythical trees and where to find them", "description": "\n\t\t\tAbstract Syntax Trees (or ASTs) are the core of most tools we use in JavaScript, from Babel to ESLint, from prettier to codemods.\r\nIn this talk we see what they are, how they power such tools and how to use them directly to develop custom solutions to everyday problems.\t\t", "language": "English"}, {"job": "Principal Software Engineer - Red Hat", "level": "Intermediate", "speaker": "Stefano Maestri", "title": "Blockchain and smart contracts, what they are and why you should really care about as a developer", "description": "\n\t\t\tAfter a brief introduction on what is blockchain technology and how it works under the wood, focusing on Ethereum the next generation blockchain implementation.\r\nWe will focus on the concept of smart contract introducing it through a simple case study and its standard implementation in ethereum.\r\nWe will code it using Solidity language deploying and testing it in a live demo on Ethereum test network.\t\t", "language": "Italian"}, {"job": "Software Engineer - Entaksi", "level": "Beginner", "speaker": "Davide Cerbo", "title": "Kotlin: forse è la volta buona", "description": "\n\t\t\tDopo 20 anni Java inizia a sentire il peso degli anni e la sua sintassi non evolve come vorremmo, ma la JVM resta sempre un ambiente affidabile ed è già in produzione presso moltissime aziende. Negli ultimi anni sono usciti molti linguaggi basati sulla JVM, ma non tutti hanno avuto il successo sperato. \r\nKotlin ha conquistato Android e, ora, grazie a una sintassi intuitiva e grandi aziende che lo supportano potrebbe essere molto utilizzato anche nelle applicazioni web. Durante il talk vedremo le basi del linguaggio e come sviluppare una applicazione web pronta ad andare in produzione.\t\t", "language": "Italian"}, {"job": "Owner - Android Secure", "level": "Beginner", "speaker": "Fabrizio Cornelli", "title": "Antropologia di un Dev(Sec)Ops secondo il modello Hunter Farmer", "description": "\n\t\t\tDa qualche tempo è buona prassi accorpare sviluppo e operazioni. Che dire invece della sicurezza?\r\nNel mondo \"business\" c'è un modello interessante che descrive due diverse figure: Hunter e Farmer, uno più esplorativo e adatto alle novità, uno più sociale e costruttivo. In questo incontro fornirò un'interpretazione di questo modello con lo scopo di semplificare la convivenza tra metodologie significativamente diverse.\t\t", "language": "Italian"}, {"job": "Software developer - SeeSaw", "level": "Intermediate", "speaker": "Thomas Rossetto", "title": "Container and microservices: a love story", "description": "\n\t\t\tQual'è la prima cosa che ti viene in mente se ti chiedessi di associare \"container\" e \"architetture\" ? Esatto !\r\nContainer e microservizi sono di fatto gli argomenti più chiacchierati degli ultimi anni e che spesso vanno a braccetto. Ma quand'è che i due mondi iniziano ad incontrarsi, se non nel tuo computer?\r\nTi porterò la mia esperienza sul uso dei container per lo sviluppo di un applicativo con architettura a microservizi, partendo dalle scelte fatte fin dai primi momenti dello sviluppo fino ad arrivare alla sua messa in produzione.\t\t", "language": "Italian"}, {"job": "Founder - Laravel-Italia", "level": "Non", "speaker": "Francesco Malatesta", "title": "Costruire una Community: \"What You Give is What You Get\"", "description": "\n\t\t\tPartecipare attivamente ad una community: tutti sanno che è importante ma in pochi lo fanno. Davvero è così importante per un developer fare un'esperienza del genere? Francesco spiegherà il suo percorso con Laravel-Italia negli ultimi quattro anni, non solo per raccontare quanto effettivamente fare community gli abbia \"restituito\" (oltre ogni aspettativa) ma anche per spiegare quale impatto ha una scelta del genere, senza dimenticare qualche consiglio per chi sta iniziando a muovere i primi passi... e non solo.\t\t", "language": "Italian"}, {"job": "Senior Software Engineer - Aicof", "level": "Intermediate", "speaker": "Danilo Del Fio", "title": "From Java8 to RxJS", "description": "\n\t\t\tI would like to show the convergence of all the languages to functional programming, even Java that is an old Object Oriented one.\t\t", "language": "Italian"}, {"job": "CEO - Impronta Advance", "level": "Beginner", "speaker": "Matteo Manchi", "title": "React Native for multi-platform mobile applications", "description": "\n\t\t\tSince its 2013 release, React has brought a new way to design UI components in the world wide web. The same fundamentals have been taken to another important environment in our contemporary world: the mobile applications. We'll see the philosophy behind React Native - learn once, write anywhere - and how this new framework helps developers to build native apps using React.\t\t", "language": "Italian"}, {"job": "Senior Frontend Developer - Credimi", "level": "Intermediate", "speaker": "Davide Di Pumpo", "title": "Quella sporca dozzina (a cascata)", "description": "\n\t\t\tDodici trucchi di cui nessuno vi parla, perché la lobby dei framework vi nasconde la verità!1!!! Dodici (circa) semplici trucchi per migliorare la vostra vita di scrittori di CSS. Costruire forme astratte, numerare elementi del DOM e soprattutto fare il ganzo con gli amici grazie alla conoscenza di proprietà CSS misconosciute.\r\nUn talk leggero e spensierato, pieno di curiosità e consigli per divertirsi ancora scrivendo CSS\t\t", "language": "Italian"}, {"job": "Senior Consultant - Microsoft", "level": "Intermediate", "speaker": "Massimo Bonanni", "title": "L'approccio ai microservizi secondo Service Fabric", "description": "\n\t\t\tService Fabric è la piattaforma, utilizzabile sia su Azure, sia on-prem che su altri cloud provider, per l'implementazione, distribuzione e gestione di soluzioni stateful e scalabili basate su microservizi. La sessione consentirà di capire quali sono i concetti alla base di Service Fabric e quali servizi e funzionalità fornisce la piattaforma sia a livello di infrastruttura che per lo sviluppatore.\t\t", "language": "Italian"}, {"job": "Co-Founder and Lead Developer - CIR2000", "level": "Intermediate", "speaker": "Nicola Iarocci", "title": "Git: storie dalla trincea", "description": "\n\t\t\tO, se volete, trucchi e barbatrucchi. Consigli e pratiche collezionate negli anni gestendo progetti open source e non solo. Alias utili, la (le) rebase, gestione delle long running branches e branching models, soluzione dei conflitti, riscrivere o modificare la storia, il reflog... Se questi argomenti vi interessano venite a vedere questa sessione mista di live coding e talk tradizionale.Più coding che slides, promesso.\t\t", "language": "English"}, {"job": "VP R&D; - Panorays", "level": "Intermediate", "speaker": "Demi Ben-Ari", "title": "Monitoring Big Data Systems Done \"The Simple Way\"", "description": "\n\t\t\tOnce you start working with Big Data systems, you discover a whole bunch of problems you won’t find in monolithic systems. Monitoring all of the components becomes a big data problem itself.\r\nIn the talk we’ll mention all of the aspects that you should take in consideration when monitoring a distributed system using tools like: \r\nWeb Services,Spark,Cassandra,MongoDB,AWS. \r\nNot only the tools, what should you monitor about the actual data that flows in the system?\r\nWe’ll cover the simplest solution with your day to day open source tools, the surprising thing, that it comes not from an Ops Guy.\t\t", "language": "English"}, {"job": "CEO and Founder - TNX", "level": "Intermediate", "speaker": "Antonio Esposito", "title": "Programmazione reattiva con Rx e C#", "description": "\n\t\t\tLa programmazione reattiva utilizza funzioni, operazioni e trasformazioni elementari ma potenti, che combinate in un macro-set di funzioni è in grado di creare una vera e propria applicazione di messaggi che continuano a cambiare. Questa sessione vuole portare alla luce chi non ha mai visto la Reactive Programming in generale o la libreria Rx per C# in particolare, con esempi concreti basati su dati reali\t\t", "language": "Italian"}, {"job": "Owner - Paro Alberto Maria Angelo", "level": "Intermediate", "speaker": "Alberto Maria Angelo Paro", "title": "Isomorphic programming in Scala and WebDevelopment in Scala.JS", "description": "\n\t\t\tScala is the only language that can be used to produce code that can be \"trans/compiled\" for the JVM, in Javascript and in native binary. This allows to write libraries that are usable in JVM and JS using the power of functional programming (i.e. cats, scalaz), generic programming (i.e. shapeless) and macro/scalameta available in Scala. In this talk, we will see how to write a Scala application backend and a SPA (scala.js/scala-js-react) that share the same code as a  business logic, datamodels and transparent API call (JVM/JS) in Scala (via autowire/akka-http/circe).\t\t", "language": "English"}, {"job": "Head of Native Games - IGT", "level": "Beginner", "speaker": "Emilia Ciardi", "title": "MVP e start-up: anche oggi una feature domani", "description": "\n\t\t\tSiete pronti per realizzare il Minimum Viable Product per la vostra mobile start-up? Da dove si comincia? Come identificare le features da includere? E come ci si assicura che il nostro MVP sarà effettivamente il primo passo verso un'app che ha tutte le caratteristiche per essere adottata dal suo target di utenti?\r\nIn questo talk esploreremo insieme le strategie e gli strumenti che ci consentiranno di affrontare al meglio le sfide tipiche del processo di progettazione e realizzazione di un MVP e come possiamo adottare l'approccio Lean per realizzare una app di successo.\t\t", "language": "Italian"}, {"job": "Senior Data Scientist - Catenate", "level": "Intermediate", "speaker": "Gabriele Nocco", "title": "Massive distributed processing with H2O", "description": "\n\t\t\tH2O è la piattaforma di analisi dati distribuita più interessante degli ultimi anni, inserita da Gartner come Visionary nella Data Science. Permette di eseguire elaborazioni massivamente parallele, e si collega facilmente a piattaforme essenziali per il calcolo distribuito ed l'analisi predittiva, incluse Spark, TensorFlow e MxNet. Nel talk conosceremo l'architettura di questa libreria, le sue funzionalità e potenzialità, tramite demo interattive con Spark, TensorFlow, ed alcuni algoritmi particolarmente in voga.\t\t", "language": "Italian"}, {"job": "CTO - Hyperfair", "level": "Advanced", "speaker": "Massimiliano Mantione", "title": "How much performance can you get out of Javascript?", "description": "\n\t\t\tJavaScript started as a slow, interpreted language, but in more than two decades things have changed completely and now we have even game engines running in the browser. \r\n\r\nWhat is its maximum theoretical performance, and how can you write code that exploits its full potential?\r\n\r\nWe'll see everything a developer must know to write regular Javascript code that literally rivals C++ code, and learn what WebAssembly adds to this.\t\t", "language": "English"}, {"job": "Partner - fsharpWorks", "level": "Beginner", "speaker": "Tomas Petricek", "title": "The Gamma: Democratizing data science", "description": "\n\t\t\tWhat if you could look at the source code behind any visualization, understand how it works, run it to check the results using the latest data and modify the parameters to explore different aspects of the data?\r\n\r\nI this talk, I will show how we used F# and functional programming to develop a new browser-based data visualization environment. I will show two fun projects that we created looking at the history of Olympic games and testing what people know about the UK government spending. Expect to learn about fun data science and programming challenges we encountered along the way!\t\t", "language": "English"}, {"job": "Software developer - LunchBadger", "level": "Intermediate", "speaker": "Vincenzo Chianese", "title": "REST, for real!", "description": "\n\t\t\tLet’s face it: the term REST is treated as a buzzword these days rather than as an accurate description of the Web’s blueprints. Everybody claim to do REST APIs; the truth is - nobody is doing REST API. It’s time to stop this. In my presentation I’d like to go with you through the original specifications and build an API that will respect all the constraints. All live, no prepared things. Then, we will compare the results with other API that claim to be REST. You will be surprised how different the results will be!\t\t", "language": "English"}, {"job": "Senior software engineer - resin.io", "level": "Intermediate", "speaker": "Tim Perry", "title": "HTTPS Is Not Enough", "description": "\n\t\t\tThe web is moving slowly towards HTTPS everywhere, but even now man-in-the-middle attacks are still astoundingly effective and easy to do.\r\n\r\nIn this talk you’ll see how to beat HTTPS on many major websites, discover the tools required to secure your own applications, and learn how to keep your users safe.\t\t", "language": "English"}, {"job": "CTO - AnotheReality", "level": "Beginner", "speaker": "Fabio Mosca", "title": "Virtual reality and the B2B world: how to get started.", "description": "\n\t\t\tSince last year, Virtual Reality is no more an unknown field. Many use-cases have been brought to life and companies are now throwing themselves in the field, seeing the advantages VR is bringing to their pioneer competitors.\r\nIn this talk we'll dive into how a VR escape room is designed and developed, which challenges it poses and the pro&cons; it brings on the market, analyzing already existing use-cases.\r\nIn this talk we'll see what developers need to learn to start to work in VR, and in which fields VR is already \"trustworthy\" for companies, bringing already existing use-cases.\t\t", "language": "English"}]}